# 0-intro to lesson 6 redirection
---
## در درس 6 کتاب linux command line قراره چی بخونیم؟
در این درس درمورد I/O redirection ها صحبت میکنیم و این دستور هایه زیر:
- ا-1-cat--->برایه نمایش محتوایه فایل یا فایل ها  و ریختن محتوا درون فایل یا فایل ها
- ا-2-sort-->مرتب سازی خطوط متن.
- ا-3-uniq-->گزارش یا حذف خطوط تکراری.
- ا-4-grep-->چاپ خطوطی که با یک الگو (pattern)مطابقت دارند.
- ا-5-wc-->شمارش تعداد خطوط،کلمات،بایت ها برای هر فایل
- ا-6-head-->نمایش قسمت از اول سر از بالا
- ا-7-tail-->نمایش از پایین
- ا-8-tee-->این دستور یک ابزار بسیار کاربردی است که **ورودی استاندارد را می‌خواند و آن را همزمان به خروجی استاندارد (صفحه نمایش) و به یک یا چند فایل می‌نویسد**.
