# 0-intro lesson 4 manipulating files
---
## این درس میخواهیم به دستوراتی بپردازیم که برایه ویرایش فایل ها استفاده میشوند دستوراتی که در این فولدر میخواهیم برسی کنیم:
- 1-دستوری برایه کپی فایل ها و دایرکتوری ها--><mark>cp</mark> 
- 2-دستوری برای برش/تغییر نام فایل ها یا دایرکتوری ها--><mark>mv</mark> 
- 3-دستور ایجاد فولدر--><mark>mkdir </mark> 
- 4-دستوری برایه پاک کردن و فایل و دایرکتوری--><mark>rm</mark> 
- 5-دستوری ساخت لینک سخت و لینک نرم یا نمادین---><mark>ln</mark> 
- 6-وایلد کاردها(wildcards)
