# Pipe sign(|) VS redirection operaton(>)
---
- 1-عملگر هایه تغییر مسیر(<)
### علامت `<`

خروجی یک دستور را داخل یک **فایل** می‌ریزد:

```
command1 > file1
```

مثلاً:

```
ls > files.txt
```

خروجی `ls` داخل فایل `files.txt` ذخیره می‌شود.

نکته مهم: اگر فایل از قبل وجود داشته باشد، `>` محتوای آن را بدون هشدار پاک و جایگزین می‌کند.

---
- 2-علامت پایپ(|)
### علامت `|`

خروجی دستور اول را به‌عنوان ورودی به **دستور دوم** می‌دهد:

```
command1 | command2
```

مثلاً:

```
ls | less
```

خروجی `ls` برای برنامه `less` فرستاده می‌شود تا بتوانی فهرست فایل‌ها را صفحه‌به‌صفحه مشاهده کنی.

---
خلاصه:

```
>  خروجی دستور را داخل فایل می‌نویسد.
|  خروجی یک دستور را به دستور بعدی می‌دهد.
```
