# 17-/usr
---

### ۱۷. `/usr`

- **مخفف:** **User System Resources** (در ابتدا مخفف _User_ بود)
- **داخلش چیست؟** بخش عظیمی از برنامه‌ها و ابزارهای سیستم در اینجا قرار دارد (فایل‌های استاتیک فقط‌خواندنی اشتراکی بین کاربران):
    - ا`/usr/bin`: دستورات پکیج‌های نصب‌شده عادی (Git, Python, Curl).
    - ا`/usr/lib`: کتابخانه‌های برنامه‌ها.
    - ا`/usr/local`: نرم‌افزارها و اسکریپت‌هایی که خود ادمین به‌صورت دستی بدون پکیج‌منیجر (مثلاً کامپایل سورس با `make install`) نصب می‌کند.
    -ا `/usr/share`: فایل‌های اشتراکی مستقل از معماری (مستندات `man pages`، فونت‌ها، آیکون‌ها).
