# 02-firstkeystrokes
# 02-بریم و اولین ضربتون رو رویه کیبورد درون لینوکس بزنیم😊
---
# اولین کد ؟
- وقتی که ترمینا رو باز کردید اگر در wsl هستید که هیچ و اگر در ماشین مجازی هستید با ctl+alt+t که ترمینال رو باز کردید میبینید که شل پرامپت اومده بالا و این یعنی شل اماده گرفتن دستور است.
```bash
arian@ubuntu:~$;asdfkjafsj
command not found
```
خب همینطوری من رویه کیبورد زدم تا تست کنیم که چی میشه 😒و همانطور که گفتیم اون برنامه ای که میاد مارو به سیستم عامل و سیستم عامل به سخت افزار وصل میکنه شل نام دارد و گفتیم که ورودی شل دستور است و اینجا دستوری نداریم به اسم ;asdfkjafsj به همین دلیل گفت دستور یافت نشد

## حالا مثلا دستور date رو میزنیم که تاریخ و ساعت رو به ما نشون
```bash
arianshokrollahi@THUNDER:~$ date
--->output
Wed Aug 26 22:10:40 +0330 2026
```
- دید حالا یه خروجی درست حسابی به ما داد چون دستور date یه برنامه ای است که بر اساس اون ساختاری که دارد تعریف شده تا وقتی میزنیمش شل بگه که این user درخواست تاریخ و ساعت رو داد و میره و به صورت خروجی دستور رو برمیگردونه
- پس چرت و پرت نمیشه نوشت باید برایه اون کارهایی که میخواید اون دستور هایی رو یاد بگیرید که اون کاررو میکنن .
