# 09-inode 
---
### اینود (Inode) چیست؟

فرض کنید یک کتابخانه بسیار بزرگ دارید که در آن هزاران کتاب نگهداری می‌شود.

- **نام فایل (Filename):** مثل عنوان روی جلد کتاب است که شما (به عنوان کاربر) می‌بینید و با آن جستجو می‌کنید.
- **محتوای فایل:** متن و اطلاعاتی است که داخل کتاب نوشته شده است.
- **اینود (Inode):** مثل **کد ملی** یا **شماره ثبت کتابخانه‌ای** آن کتاب است.

در سیستم‌فایل‌های لینوکس (مثل ext4)، نام فایل‌ها و پوشه‌ها در واقع فقط یک «برچسب» انسانی هستند که به یک **Inode** اشاره می‌کنند. خود Inode شامل تمام اطلاعات فنی و متادیتا (Metadata) مربوط به آن فایل است، **به جز خود نام فایل و محتوای آن!**

---
### یک Inode چه اطلاعاتی را نگه می‌دارد؟

وقتی دستور `ls -i` را بزنید، شماره اینود فایل‌ها را می‌بینید. هر Inode شامل اطلاعات زیر است:

1. **اندازه فایل (File size)**
2. **مجوزهای دسترسی (Permissions/Chmod)**
3. **مالک و گروه فایل (UID و GID)**
4. **تاریخ ایجاد، تغییر و دسترسی (Timestamps)**
5. **تعداد لینک‌ها (Link count)**
6. **آدرس بلوک‌های دیسک:** اشاره‌گرهایی که می‌گویند محتوای واقعی این فایل دقیقا کجای هارد درایو (Blockهای سخت‌افزاری) ذخیره شده است
